cask "firefox"
cask "brave-browser"
cask "google-chrome"
cask "google-drive"
cask "dropbox"
cask "flux"
cask "textmate"
cask "slack"
cask "virtualbox"
cask "istat-menus"
cask "setapp"

# Productivity
cask "boostnote"
cask "evernote"
cask "notion"
cask "bitwarden"

# Multimedia
cask "vlc"
cask "spotify"
cask "flixtools"
cask "kindle"

# GNU core utilities (those that come with OS X are outdated)
brew "coreutils"
brew "moreutils"
# GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed
brew "findutils"

brew "zplug"
brew "cask"
brew "zsh"
brew "fasd"
brew "fzf"
brew "direnv"
brew "cheat"
brew "wget"
brew "curl"
brew "httpie"
brew "imagemagick"
brew "speedtest-cli"
brew "archey"
brew "htop"
brew "tree"
brew "jq"
brew "neofetch"  # nice system info
brew "hstr"      # bash and zsh shell history suggest box - easily view, navigate, search and manage your command history
brew "rsync"
brew "lsd"       # The next gen ls command
brew "dust"      # A more intuitive version of du in rust
brew "bat"       # A cat(1) clone with wings.

# Development
brew "git"
brew "vim"
brew "redis"
brew "sqlite"
brew "postgresql"
brew "python"
brew "python3"
brew "ruby"
brew "pulumi"

cask "iterm2"
# cask "jetbrains-toolbox"
cask "react-native-debugger"
cask "atom"
cask "docker"
cask "postico"
cask "visual-studio-code"

## Node
brew "node"
brew "yarn"
# !!! Do not install nvm here, since it will be installed by the zsh plugin !!!

## Java
brew "ant"
brew "jenv"
brew "mvnvm"
